{
  "cards": {
    "PAD": 0,
    "UNKNOWN": 1,
    "STRIKE_IRONCLAD": 2,
    "BASH": 3,
    "DEFEND_IRONCLAD": 4,
    "HEADBUTT": 5,
    "STAMPEDE": 6,
    "SWORD_BOOMERANG": 7,
    "TORIC_TOUGHNESS": 8,
    "SETUP_STRIKE": 9,
    "BATTLE_TRANCE": 10,
    "SECOND_WIND": 11,
    "SLIMED": 12,
    "NEOWS_FURY": 13,
    "INFERNAL_BLADE": 14,
    "FIEND_FIRE": 15,
    "GRAPPLE": 16,
    "BLOODLETTING": 17,
    "THUNDERCLAP": 18,
    "BLUDGEON": 19,
    "CASCADE": 20,
    "IRON_WAVE": 21,
    "HIDDEN_GEM": 22,
    "PYRE": 23,
    "RAMPAGE": 24,
    "STONE_ARMOR": 25,
    "RAGE": 26,
    "JUGGLING": 27,
    "WOUND": 28,
    "ANGER": 29,
    "SPITE": 30,
    "BODY_SLAM": 31,
    "HAVOC": 32,
    "INFLAME": 33,
    "JACK_OF_ALL_TRADES": 34,
    "THRUMMING_HATCHET": 35,
    "FASTEN": 36,
    "ASHEN_STRIKE": 37,
    "TRUE_GRIT": 38,
    "FLAME_BARRIER": 39,
    "SHRUG_IT_OFF": 40,
    "PERFECTED_STRIKE": 41,
    "FEED": 42,
    "CRUELTY": 43,
    "WHIRLWIND": 44
  },
  "relics": {
    "PAD": 0,
    "UNKNOWN": 1,
    "BURNING_BLOOD": 2,
    "STONE_HUMIDIFIER": 3,
    "LARGE_CAPSULE": 4,
    "LASTING_CANDY": 5,
    "NUNCHAKU": 6,
    "SMALL_CAPSULE": 7,
    "ORNAMENTAL_FAN": 8,
    "LOST_COFFER": 9,
    "NEOWS_TORMENT": 10,
    "NEOWS_TALISMAN": 11,
    "CENTENNIAL_PUZZLE": 12,
    "NUTRITIOUS_OYSTER": 13,
    "ARCANE_SCROLL": 14
  },
  "enemies": {
    "PAD": 0,
    "UNKNOWN": 1,
    "小啃兽": 2,
    "缩小甲虫": 3,
    "树叶史莱姆（小）": 4,
    "树枝史莱姆（中）": 5,
    "树枝史莱姆（小）": 6,
    "毛绒伏地虫": 7,
    "树叶史莱姆（中）": 8,
    "蛮兽": 9,
    "藤蔓蹒跚者": 10,
    "立柱构造体": 11,
    "墨影幻灵": 12,
    "劫掠者斧手": 13,
    "劫掠者刺客": 14,
    "劫掠者暴徒": 15,
    "蛇行扼杀者": 16
  },
  "status": {
    "PAD": 0,
    "UNKNOWN": 1,
    "VULNERABLE_POWER": 2,
    "SHRINK_POWER": 3,
    "STAMPEDE_POWER": 4,
    "STRENGTH_POWER": 5,
    "SETUP_STRIKE_POWER": 6,
    "NO_DRAW_POWER": 7,
    "GRAPPLE_POWER": 8,
    "TANGLED_POWER": 9,
    "ARTIFACT_POWER": 10,
    "SLIPPERY_POWER": 11,
    "PLATING_POWER": 12,
    "RAGE_POWER": 13,
    "PYRE_POWER": 14,
    "JUGGLING_POWER": 15,
    "FASTEN_POWER": 16
  },
  "actions": {
    "PAD": 0,
    "UNKNOWN": 1,
    "end_turn": 2,
    "play_card_BASH": 3,
    "play_card_STRIKE_IRONCLAD": 4,
    "play_card_DEFEND_IRONCLAD": 5,
    "play_card_HEADBUTT": 6,
    "play_card_STAMPEDE": 7,
    "play_card_SWORD_BOOMERANG": 8,
    "play_card_SETUP_STRIKE": 9,
    "play_card_BATTLE_TRANCE": 10,
    "play_card_SLIMED": 11,
    "play_card_NEOWS_FURY": 12,
    "play_card_INFERNAL_BLADE": 13,
    "play_card_FIEND_FIRE": 14,
    "play_card_GRAPPLE": 15,
    "play_card_BLOODLETTING": 16,
    "play_card_BLUDGEON": 17,
    "play_card_THUNDERCLAP": 18,
    "play_card_CASCADE": 19,
    "play_card_IRON_WAVE": 20,
    "play_card_STONE_ARMOR": 21,
    "play_card_RAGE": 22,
    "play_card_PYRE": 23,
    "play_card_JUGGLING": 24,
    "play_card_HIDDEN_GEM": 25,
    "play_card_ANGER": 26,
    "play_card_SPITE": 27,
    "play_card_BODY_SLAM": 28,
    "play_card_HAVOC": 29,
    "play_card_INFLAME": 30,
    "play_card_JACK_OF_ALL_TRADES": 31,
    "play_card_THRUMMING_HATCHET": 32,
    "play_card_ASHEN_STRIKE": 33,
    "play_card_FASTEN": 34,
    "play_card_SHRUG_IT_OFF": 35,
    "play_card_PERFECTED_STRIKE": 36,
    "play_card_FEED": 37,
    "play_card_WHIRLWIND": 38,
    "play_card_MOLTEN_FIST": 39
  },
  "intent_types": {
    "PAD": 0,
    "UNKNOWN": 1,
    "Attack": 2,
    "Defend": 3,
    "Buff": 4,
    "DebuffStrong": 5,
    "StatusCard": 6,
    "Debuff": 7,
    "CardDebuff": 8
  }
}