{
  "actions": {
    "PAD": 0,
    "UNKNOWN": 1,
    "choose_event_option:unknown": 2,
    "claim_reward:gold": 3,
    "claim_reward:card": 4,
    "claim_reward:potion": 5,
    "choose_rest_option:choose_rest_option": 6,
    "buy_item:?": 7,
    "choose_event_option:index_0": 8,
    "select_map_node:index_1": 9,
    "select_map_node:index_0": 10,
    "claim_reward:relic": 11,
    "choose_card:index_1": 12,
    "choose_card:index_0": 13,
    "buy_item:card_removal": 14,
    "choose_card:index_2": 15,
    "select_map_node:index_2": 16,
    "buy_item:FEED": 17,
    "buy_item:HIDDEN_GEM": 18,
    "buy_item:THE_BOMB": 19,
    "buy_item:MANGLE": 20,
    "buy_item:GREMLIN_HORN": 21,
    "buy_item:CHANDELIER": 22,
    "buy_item:PREP_TIME": 23,
    "buy_item:SWORD_BOOMERANG": 24
  },
  "characters": {
    "PAD": 0,
    "UNKNOWN": 1,
    "铁甲战士": 2
  },
  "rooms": {
    "PAD": 0,
    "UNKNOWN": 1,
    "EventRoom": 2,
    "CombatRoom": 3,
    "RestSiteRoom": 4,
    "MerchantRoom": 5,
    "TreasureRoom": 6
  },
  "screens": {
    "PAD": 0,
    "UNKNOWN": 1,
    "EventRoom": 2,
    "CombatRoom": 3,
    "RestSiteRoom": 4,
    "MerchantRoom": 5,
    "rewards": 6,
    "event": 7,
    "map": 8,
    "shop": 9,
    "rest_site": 10,
    "card_reward": 11,
    "fake_merchant": 12,
    "card_select": 13
  },
  "relics": {
    "PAD": 0,
    "UNKNOWN": 1,
    "BURNING_BLOOD": 2,
    "LARGE_CAPSULE": 3,
    "TOXIC_EGG": 4,
    "ORNAMENTAL_FAN": 5,
    "STONE_CRACKER": 6,
    "SWORD_OF_STONE": 7,
    "PAELS_BLOOD": 8,
    "REGAL_PILLOW": 9,
    "ORICHALCUM": 10,
    "MINIATURE_TENT": 11,
    "MEAT_ON_THE_BONE": 12,
    "HORN_CLEAT": 13,
    "BLESSED_ANTLER": 14,
    "PEN_NIB": 15,
    "LOST_COFFER": 16,
    "TEA_OF_DISCOURTESY": 17,
    "CHOSEN_CHEESE": 18,
    "WAR_PAINT": 19,
    "RED_SKULL": 20,
    "RED_MASK": 21,
    "YUMMY_COOKIE": 22,
    "FAKE_ANCHOR": 23,
    "FAKE_HAPPY_FLOWER": 24,
    "BOWLER_HAT": 25,
    "GREMLIN_HORN": 26,
    "GLITTER": 27,
    "ANCHOR": 28,
    "NEOWS_TALISMAN": 29,
    "ARCANE_SCROLL": 30,
    "PLANISPHERE": 31,
    "NUNCHAKU": 32,
    "AKABEKO": 33,
    "JUZU_BRACELET": 34,
    "VERY_HOT_COCOA": 35,
    "WHETSTONE": 36,
    "PENDULUM": 37,
    "LOOMING_FRUIT": 38,
    "FRAGRANT_MUSHROOM": 39,
    "STURDY_CLAMP": 40,
    "CHANDELIER": 41
  },
  "potions": {
    "PAD": 0,
    "UNKNOWN": 1,
    "SKILL_POTION": 2,
    "VULNERABLE_POTION": 3,
    "POWER_POTION": 4,
    "LIQUID_BRONZE": 5,
    "POTION_OF_BINDING": 6,
    "FIRE_POTION": 7,
    "FLEX_POTION": 8,
    "BLOCK_POTION": 9,
    "BLOOD_POTION": 10,
    "EXPLOSIVE_AMPOULE": 11,
    "ENTROPIC_BREW": 12,
    "GLOWWATER_POTION": 13,
    "OROBIC_ACID": 14,
    "ENERGY_POTION": 15,
    "STABLE_SERUM": 16,
    "FAIRY_IN_A_BOTTLE": 17,
    "STRENGTH_POTION": 18,
    "DEXTERITY_POTION": 19,
    "LUCKY_TONIC": 20,
    "FOUL_POTION": 21,
    "GIGANTIFICATION_POTION": 22,
    "RADIANT_TINCTURE": 23,
    "GAMBLERS_BREW": 24,
    "HEART_OF_IRON": 25
  },
  "node_types": {
    "PAD": 0,
    "UNKNOWN": 1,
    "Unknown": 2,
    "Elite": 3,
    "Shop": 4,
    "Monster": 5,
    "RestSite": 6,
    "UnknownEvent": 7
  },
  "reward_types": {
    "PAD": 0,
    "UNKNOWN": 1,
    "potion": 2,
    "card": 3,
    "gold": 4,
    "relic": 5
  },
  "cards": {
    "PAD": 0,
    "UNKNOWN": 1,
    "SPITE": 2,
    "BULLY": 3,
    "BLOODLETTING": 4,
    "UPPERCUT": 5,
    "THUNDERCLAP": 6,
    "SWORD_BOOMERANG": 7,
    "FLAME_BARRIER": 8,
    "MOLTEN_FIST": 9,
    "BREAKTHROUGH": 10,
    "CONFLAGRATION": 11,
    "BURNING_PACT": 12,
    "BRAND": 13,
    "HELLRAISER": 14,
    "CASCADE": 15,
    "TRUE_GRIT": 16,
    "ANGER": 17,
    "HOWL_FROM_BEYOND": 18,
    "STOMP": 19,
    "HAVOC": 20,
    "SHRUG_IT_OFF": 21,
    "BATTLE_TRANCE": 22,
    "EXPECT_A_FIGHT": 23,
    "UNRELENTING": 24,
    "HEMOKINESIS": 25,
    "INFERNO": 26,
    "HEADBUTT": 27,
    "POMMEL_STRIKE": 28,
    "BODY_SLAM": 29,
    "PERFECTED_STRIKE": 30,
    "DISMANTLE": 31,
    "IRON_WAVE": 32,
    "TREMBLE": 33,
    "DEMON_FORM": 34,
    "INFERNAL_BLADE": 35,
    "ARMAMENTS": 36,
    "TWIN_STRIKE": 37,
    "JUGGERNAUT": 38,
    "CRUELTY": 39,
    "FORGOTTEN_RITUAL": 40,
    "FEEL_NO_PAIN": 41,
    "INFLAME": 42,
    "TAUNT": 43,
    "CRIMSON_MANTLE": 44,
    "RAMPAGE": 45,
    "RESTLESSNESS": 46,
    "MIND_BLAST": 47,
    "FLASH_OF_STEEL": 48,
    "STOKE": 49,
    "BARRICADE": 50,
    "DARK_EMBRACE": 51,
    "FIGHT_ME": 52,
    "DOMINATE": 53,
    "PRIMAL_FORCE": 54,
    "RUPTURE": 55
  },
  "card_types": {
    "PAD": 0,
    "UNKNOWN": 1,
    "Attack": 2,
    "Skill": 3,
    "Power": 4
  },
  "rarities": {
    "PAD": 0,
    "UNKNOWN": 1,
    "Uncommon": 2,
    "Common": 3,
    "Rare": 4
  }
}