{
  "actions": {
    "PAD": 0,
    "UNKNOWN": 1,
    "choose_event_option:unknown": 2,
    "claim_reward:relic": 3,
    "choose_event_option:index_0": 4,
    "select_map_node:index_2": 5,
    "claim_reward:gold (13)": 6,
    "claim_reward:gold": 7,
    "claim_reward:potion (能量药水)": 8,
    "claim_reward:potion": 9,
    "claim_reward:card (opens card selection)": 10,
    "claim_reward:card": 11,
    "choose_card:index_0": 12,
    "select_map_node:index_0": 13,
    "claim_reward:gold (11)": 14,
    "choose_card:index_2": 15,
    "select_map_node:index_1": 16,
    "claim_reward:gold (45)": 17,
    "claim_reward:potion (技能药水)": 18,
    "choose_card:index_1": 19,
    "choose_rest_option:choose_rest_option": 20,
    "claim_reward:gold (41)": 21,
    "claim_reward:gold (44)": 22,
    "claim_reward:gold (100)": 23,
    "claim_reward:potion (虚弱药水)": 24,
    "claim_reward:gold (14)": 25,
    "claim_reward:potion (无色药水)": 26,
    "buy_item:item_cost75": 27,
    "buy_item:card_removal": 28,
    "buy_item:item_cost50": 29,
    "buy_item:SHRUG_IT_OFF": 30,
    "buy_item:item_cost217": 31,
    "buy_item:LEES_WAFFLE": 32,
    "buy_item:item_cost25": 33,
    "buy_item:HEADBUTT": 34,
    "buy_item:ATTACK_POTION": 35,
    "claim_reward:potion (肌肉药水)": 36,
    "claim_reward:gold (37)": 37,
    "buy_item:item_cost100": 38,
    "buy_item:item_cost195": 39,
    "buy_item:VENERABLE_TEA_SET": 40,
    "buy_item:EXPLOSIVE_AMPOULE": 41,
    "buy_item:item_cost71": 42,
    "buy_item:VICIOUS": 43,
    "buy_item:item_cost49": 44,
    "buy_item:BLOOD_WALL": 45,
    "buy_item:item_cost74": 46,
    "buy_item:FIEND_FIRE": 47,
    "buy_item:item_cost48": 48,
    "buy_item:BLOOD_POTION": 49,
    "buy_item:item_cost51": 50,
    "buy_item:POWER_POTION": 51,
    "claim_reward:gold (15)": 52,
    "claim_reward:potion (力量药水)": 53,
    "claim_reward:gold (36)": 54,
    "claim_reward:potion (消亡粉末)": 55,
    "buy_item:?": 56,
    "buy_item:FEED": 57,
    "buy_item:HIDDEN_GEM": 58,
    "buy_item:THE_BOMB": 59,
    "buy_item:MANGLE": 60,
    "buy_item:GREMLIN_HORN": 61,
    "buy_item:CHANDELIER": 62,
    "buy_item:PREP_TIME": 63,
    "buy_item:SWORD_BOOMERANG": 64
  },
  "characters": {
    "PAD": 0,
    "UNKNOWN": 1,
    "铁甲战士": 2
  },
  "rooms": {
    "PAD": 0,
    "UNKNOWN": 1,
    "EventRoom": 2,
    "CombatRoom": 3,
    "RestSiteRoom": 4,
    "MerchantRoom": 5,
    "TreasureRoom": 6
  },
  "screens": {
    "PAD": 0,
    "UNKNOWN": 1,
    "event": 2,
    "rewards": 3,
    "map": 4,
    "card_reward": 5,
    "rest_site": 6,
    "shop": 7,
    "card_select": 8,
    "EventRoom": 9,
    "CombatRoom": 10,
    "RestSiteRoom": 11,
    "MerchantRoom": 12,
    "fake_merchant": 13
  },
  "relics": {
    "PAD": 0,
    "UNKNOWN": 1,
    "BURNING_BLOOD": 2,
    "SMALL_CAPSULE": 3,
    "MERCURY_HOURGLASS": 4,
    "STONE_CALENDAR": 5,
    "SWORD_OF_STONE": 6,
    "BRONZE_SCALES": 7,
    "PANTOGRAPH": 8,
    "ETERNAL_FEATHER": 9,
    "PUMPKIN_CANDLE": 10,
    "LOST_WISP": 11,
    "LEES_WAFFLE": 12,
    "VAJRA": 13,
    "VENERABLE_TEA_SET": 14,
    "SWORD_OF_JADE": 15,
    "STRIKE_DUMMY": 16,
    "LARGE_CAPSULE": 17,
    "TOXIC_EGG": 18,
    "ORNAMENTAL_FAN": 19,
    "STONE_CRACKER": 20,
    "PAELS_BLOOD": 21,
    "REGAL_PILLOW": 22,
    "ORICHALCUM": 23,
    "MINIATURE_TENT": 24,
    "MEAT_ON_THE_BONE": 25,
    "HORN_CLEAT": 26,
    "BLESSED_ANTLER": 27,
    "PEN_NIB": 28,
    "LOST_COFFER": 29,
    "TEA_OF_DISCOURTESY": 30,
    "CHOSEN_CHEESE": 31,
    "WAR_PAINT": 32,
    "RED_SKULL": 33,
    "RED_MASK": 34,
    "YUMMY_COOKIE": 35,
    "FAKE_ANCHOR": 36,
    "FAKE_HAPPY_FLOWER": 37,
    "BOWLER_HAT": 38,
    "GREMLIN_HORN": 39,
    "GLITTER": 40,
    "ANCHOR": 41,
    "NEOWS_TALISMAN": 42,
    "ARCANE_SCROLL": 43,
    "PLANISPHERE": 44,
    "NUNCHAKU": 45,
    "AKABEKO": 46,
    "JUZU_BRACELET": 47,
    "VERY_HOT_COCOA": 48,
    "WHETSTONE": 49,
    "PENDULUM": 50,
    "LOOMING_FRUIT": 51,
    "FRAGRANT_MUSHROOM": 52,
    "STURDY_CLAMP": 53,
    "CHANDELIER": 54
  },
  "potions": {
    "PAD": 0,
    "UNKNOWN": 1,
    "ENERGY_POTION": 2,
    "SKILL_POTION": 3,
    "WEAK_POTION": 4,
    "COLORLESS_POTION": 5,
    "ATTACK_POTION": 6,
    "FLEX_POTION": 7,
    "EXPLOSIVE_AMPOULE": 8,
    "BLOOD_POTION": 9,
    "POWER_POTION": 10,
    "STRENGTH_POTION": 11,
    "POWDERED_DEMISE": 12,
    "VULNERABLE_POTION": 13,
    "LIQUID_BRONZE": 14,
    "POTION_OF_BINDING": 15,
    "FIRE_POTION": 16,
    "BLOCK_POTION": 17,
    "ENTROPIC_BREW": 18,
    "GLOWWATER_POTION": 19,
    "OROBIC_ACID": 20,
    "STABLE_SERUM": 21,
    "FAIRY_IN_A_BOTTLE": 22,
    "DEXTERITY_POTION": 23,
    "LUCKY_TONIC": 24,
    "FOUL_POTION": 25,
    "GIGANTIFICATION_POTION": 26,
    "RADIANT_TINCTURE": 27,
    "GAMBLERS_BREW": 28,
    "HEART_OF_IRON": 29
  },
  "node_types": {
    "PAD": 0,
    "UNKNOWN": 1,
    "Monster": 2,
    "UnknownEvent": 3,
    "Unknown": 4,
    "RestSite": 5,
    "Elite": 6,
    "Shop": 7
  },
  "reward_types": {
    "PAD": 0,
    "UNKNOWN": 1,
    "relic": 2,
    "gold": 3,
    "potion": 4,
    "card": 5
  },
  "cards": {
    "PAD": 0,
    "UNKNOWN": 1,
    "BLOOD_WALL": 2,
    "HEMOKINESIS": 3,
    "INFERNAL_BLADE": 4,
    "DRUM_OF_BATTLE": 5,
    "INFLAME": 6,
    "FIGHT_ME": 7,
    "MOLTEN_FIST": 8,
    "COLOSSUS": 9,
    "SHRUG_IT_OFF": 10,
    "HOWL_FROM_BEYOND": 11,
    "BLOODLETTING": 12,
    "EVIL_EYE": 13,
    "BLUDGEON": 14,
    "FLAME_BARRIER": 15,
    "RAGE": 16,
    "PERFECTED_STRIKE": 17,
    "UNRELENTING": 18,
    "CASCADE": 19,
    "DEMON_FORM": 20,
    "ONE_TWO_PUNCH": 21,
    "TAUNT": 22,
    "SWORD_BOOMERANG": 23,
    "BREAKTHROUGH": 24,
    "SETUP_STRIKE": 25,
    "PILLAGE": 26,
    "CINDER": 27,
    "IRON_WAVE": 28,
    "CRIMSON_MANTLE": 29,
    "HAVOC": 30,
    "WHIRLWIND": 31,
    "STONE_ARMOR": 32,
    "BULLY": 33,
    "TREMBLE": 34,
    "POMMEL_STRIKE": 35,
    "RUPTURE": 36,
    "SPITE": 37,
    "UPPERCUT": 38,
    "THUNDERCLAP": 39,
    "CONFLAGRATION": 40,
    "BURNING_PACT": 41,
    "BRAND": 42,
    "HELLRAISER": 43,
    "TRUE_GRIT": 44,
    "ANGER": 45,
    "STOMP": 46,
    "BATTLE_TRANCE": 47,
    "EXPECT_A_FIGHT": 48,
    "INFERNO": 49,
    "HEADBUTT": 50,
    "BODY_SLAM": 51,
    "DISMANTLE": 52,
    "ARMAMENTS": 53,
    "TWIN_STRIKE": 54,
    "JUGGERNAUT": 55,
    "CRUELTY": 56,
    "FORGOTTEN_RITUAL": 57,
    "FEEL_NO_PAIN": 58,
    "RAMPAGE": 59,
    "RESTLESSNESS": 60,
    "MIND_BLAST": 61,
    "FLASH_OF_STEEL": 62,
    "STOKE": 63,
    "BARRICADE": 64,
    "DARK_EMBRACE": 65,
    "DOMINATE": 66,
    "PRIMAL_FORCE": 67
  },
  "card_types": {
    "PAD": 0,
    "UNKNOWN": 1,
    "Skill": 2,
    "Attack": 3,
    "Power": 4
  },
  "rarities": {
    "PAD": 0,
    "UNKNOWN": 1,
    "Common": 2,
    "Uncommon": 3,
    "Rare": 4
  }
}